"use client";
import * as TW from "@material-tailwind/react";
import * as React from "react";
import * as XLSX from "xlsx";
import * as Icon from "@heroicons/react/24/solid";
import axios from "axios";
import { AgGridReact } from "ag-grid-react";
import "ag-grid-community/styles/ag-grid.css";
import "ag-grid-community/styles/ag-theme-alpine.css";

export default function Report() {
  const [range, setRange] = React.useState(null);
  const [year, setYear] = React.useState(new Date().getFullYear().toString());
  const [quarter, setQuarter] = React.useState("1");
  const [show, setShow] = React.useState(false);
  const [taxesData, setTaxesData] = React.useState<any[]>();
  const gridRef = React.useRef<AgGridReact<any>>(null); // Optional - for accessing Grid's API
  const [rowData, setRowData] = React.useState(); // Set rowData to Array of Objects, one Object per Row

  // Each Column Definition results in one Column.
  const [columnDefs, setColumnDefs] = React.useState([
    {
      field: "taxes_number",
      headerName: "Татвар төлөгчийн дугаар",
      cellClass: "stringType",
      filter: true,
    },
    { field: "lastname", headerName: "Овог", filter: true },
    { field: "firstname", headerName: "Нэр", filter: true },
    {
      field: "1",
      headerName: "Хуулийн 7.1.1",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) => formater.format(params.value),
    },
    {
      field: "2",
      headerName: "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7",
      editable: true,
    },
    {
      field: "3",
      headerName: "Хуулийн 7.1.6",
      editable: true,
    },
    {
      field: "4",
      headerName: "Нийт (1+2+3)",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        formater.format(
          Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"])
        ),
    },
    { field: "5", headerName: "ЭМД, НДШ Хувь" },
    {
      field: "6",
      headerName: "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) => formater.format(params.value),
    },
    {
      field: "7",
      headerName: "ЭМД, НДШ Дүн (Хуулийн 7,1,6)",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        formater.format(Number(params.data["3"]) * 0.115),
    },
    {
      field: "8",
      headerName:
        "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        /* 4 = Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"]) */
        formater.format(
          Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"]) -
            Number(params.data["6"]) -
            Number(params.data["7"])
        ),
    },
    { field: "9", headerName: "Орлогын төрөл" },
    { field: "10", headerName: "Орлого" },
    {
      field: "11",
      headerName: "Нийт татвар ногдуулах орлого",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        /* 4 = Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"]) */
        formater.format(
          Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"]) -
            Number(params.data["6"]) -
            Number(params.data["7"])
        ),
      // formater.format(Number(params.data["8"])),
    },
    {
      field: "12",
      headerName: "Шатлал",
      editable: true,
      /*
    120say = 1
    120 - 180say = 2
    180say < = 3
    */
    },
    {
      field: "13",
      headerName:
        "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) => {
        const income = params.data["11"];
        let taxes;
        if (income <= 10000000) {
          taxes = income * 0.1;
        } else if (income <= 15000000) {
          taxes = 10000000 * 0.1 + (income - 10000000) * 0.15;
        } else {
          taxes = 10000000 * 0.1 + 5000000 * 0.15 + (income - 15000000) * 0.2;
        }
        return formater.format(Number(params.value));
      },

      /*sar bolgon deeree
        if("11" <= 10,000,000) "11" *0.1
        else if("11" <= 15,000,000){
           a = 10,000,000 * 0.1
               b = ("11" - 10,000,000) * 0.15
              a + b
        }else {
          a = 10,000,000 * 0.1
          b = 5,000,000 * 0.15
          c = ("11" - (a + b)) *0.20
          a + b + c
        }*/
    },
    {
      field: "14",
      headerName: "Орлого хүлээн авсан сарын тоо /ажилласан сар/",
    },
    { field: "15", headerName: "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох" },
    {
      field: "16",
      headerName: "Хуулийн 23.1-т заасан хөнгөлөлт нийт",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) => {
        const income = params.data["11"];
        let result = 0;
        if (income <= 500000) {
          result = 20000;
        } else if (income <= 1000000) {
          result = 18000;
        } else if (income <= 1500000) {
          result = 16000;
        } else if (income <= 2000000) {
          result = 14000;
        } else if (income <= 2500000) {
          result = 12000;
        } else if (income <= 3000000) {
          result = 10000;
        }
        return formater.format(Number(params.value));
      },
      /*
      "11"
      0-500,000 = 20,000
      501,000-1,000,000 = 18,000
      1,000,001 - 1,500,000 = 16,000
      1,500,001 - 2,000,000 = 14,000
      2,000,001 - 2,500,000 = 12,000
      2,500,001 - 3,000,000 = 10,000
      */
    },
    {
      field: "17",
      headerName:
        "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        /*11 = (Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"])) -
            Number(params.data["6"]) -
            Number(params.data["7"]) */
        formater.format(Number(params.data["13"]) - Number(params.data["16"])),
    },
    {
      field: "18",
      headerName: "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        formater.format(Number(params.data["3"]) * 0.1),
    },
    {
      field: "19",
      headerName: "Шууд бус орлогод ногдуулсан албан татвар",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        formater.format(Number(params.data["2"]) * 0.1),
    },
    {
      field: "20",
      headerName: "Нийт суутгуулсан албан татварын дүн",
      cellEditor: "agNumberCellEditor",
      valueFormatter: (params: any) =>
        /* 17 = (Number(params.data["1"]) +
        Number(params.data["2"]) +
        Number(params.data["3"])) -
        Number(params.data["6"]) -
        Number(params.data["7"]) - Number(params.data["13"])
        
        18 = (Number(params.data["3"]) * 0.1)
        19 = (Number(params.data["2"]) * 0.1)*/
        formater.format(
          Number(params.data["1"]) +
            Number(params.data["2"]) +
            Number(params.data["3"]) -
            Number(params.data["6"]) -
            Number(params.data["7"]) -
            Number(params.data["13"]) +
            Number(params.data["3"]) * 0.1 +
            Number(params.data["2"]) * 0.1
        ),
    },
  ]);
  const formater = Intl.NumberFormat("en-US", {
    minimumFractionDigits: 2,
    maximumFractionDigits: 2,
  });

  const onBtExport = React.useCallback(() => {
    gridRef.current!.api.exportDataAsExcel();
  }, []);

  // Example of consuming Grid Event
  const cellClickedListener = React.useCallback((event: any) => {
    console.log("cellClicked", event);
  }, []);
  // React.useEffect(()=>{

  // },[])
  const options = {
    // The columns to export
    columns: ["taxes_number", "lastname", "firstname", "1", "2", "3", "4"],
    // The format of the Excel file
    format: "xlsx",
  };

  const getData = () => {
    axios
      .get(`${process.env.NEXT_PUBLIC_PATH_API}/taxes/report`, {
        params: { year: year, quarter: quarter },
      })
      .then((response) => {
        if (response.data.success) {
          console.log(response.data.result);
          setTaxesData(
            response.data.result.map(
              (row: {
                id: number;
                firstname: string;
                lastname: string;
                taxes_number: string;
                register_number: string;
                nd_value: number;
                nd_fee: number;
                nd_tax: number;
                nd_tax_discount: number;
              }) => ({
                taxes_number: row.taxes_number,
                lastname: row.lastname,
                firstname: row.firstname,
                1: row.nd_value,
                2: "0",
                3: "0",
                4: row.nd_value,
                5: "0",
                6: row.nd_fee,
                7: "0",
                8: row.nd_value - row.nd_value * 0.115,
                9: "0",
                10: "0",
                11: row.nd_value - row.nd_value * 0.115,
                12: "1",
                13: row.nd_tax,
                14: "3",
                15: "999",
                16: row.nd_tax_discount,
                17:
                  row.nd_value -
                  row.nd_value * 0.115 -
                  (row.nd_value - row.nd_value * 0.115) * 0.1,
                18: "0",
                19: "0",
                20:
                  row.nd_value -
                  row.nd_value * 0.115 -
                  (row.nd_value - row.nd_value * 0.115) * 0.1,
              })
            )
          );
        }
      });
  };

  const data = [
    {
      "Татвар төлөгчийн дугаар": "111080670646",
      "Хуулийн 7.1.1": "25931804",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "25931804",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "24034304",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "24034304",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "2403430.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "999",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "2403430.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "2403430.4",
    },
    {
      "Татвар төлөгчийн дугаар": "111085210099",
      "Хуулийн 7.1.1": "16376019",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "16376019",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1591185",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14784834",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14784834",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1478483.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "999",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1478483.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1478483.4",
    },
    {
      "Татвар төлөгчийн дугаар": "112264190539",
      "Хуулийн 7.1.1": "21535288",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "21535288",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1870778",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "19664510",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "19664510",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1966451",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "999",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1966451",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1966451",
    },
    {
      "Татвар төлөгчийн дугаар": "112539351505",
      "Хуулийн 7.1.1": "12017236",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "12017236",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1323490",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "10693746",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "10693746",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1069374.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "999",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1069374.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1069374.6",
    },
    {
      "Татвар төлөгчийн дугаар": "651967081979",
      "Хуулийн 7.1.1": "5586755",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5586755",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "642475",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4944280",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4944280",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "494428",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "494428",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "494428",
    },
    {
      "Татвар төлөгчийн дугаар": "111979810771",
      "Хуулийн 7.1.1": "7713408",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7713408",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "887040",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6826368",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6826368",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "682636.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "682636.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "682636.8",
    },
    {
      "Татвар төлөгчийн дугаар": "111947221554",
      "Хуулийн 7.1.1": "42630592",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "42630592",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "40733092",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "40733092",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "4073309.2",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "4073309.2",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "4073309.2",
    },
    {
      "Татвар төлөгчийн дугаар": "111082201251",
      "Хуулийн 7.1.1": "8288050",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8288050",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "953124",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7334926",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7334926",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "733492.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "733492.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "733492.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111687441182",
      "Хуулийн 7.1.1": "10997476",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "10997476",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1264708",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "9732768",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "9732768",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "973276.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "973276.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "973276.8",
    },
    {
      "Татвар төлөгчийн дугаар": "112249291122",
      "Хуулийн 7.1.1": "7041264",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7041264",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "809744",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6231520",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6231520",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "623152",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "623152",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "623152",
    },
    {
      "Татвар төлөгчийн дугаар": "110758001989",
      "Хуулийн 7.1.1": "9823616",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9823616",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1129713",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8693903",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8693903",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "869390.3",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "869390.3",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "869390.3",
    },
    {
      "Татвар төлөгчийн дугаар": "111073681758",
      "Хуулийн 7.1.1": "4461575",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "4461575",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "513080",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "3948495",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "3948495",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "394849.5",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "394849.5",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "394849.5",
    },
    {
      "Татвар төлөгчийн дугаар": "111016581435",
      "Хуулийн 7.1.1": "42225054",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "42225054",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "40327554",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "40327554",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "4032755.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "4032755.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "4032755.4",
    },
    {
      "Татвар төлөгчийн дугаар": "112202271979",
      "Хуулийн 7.1.1": "12444264",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "12444264",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1348044",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "11096220",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "11096220",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1109622",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1109622",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1109622",
    },
    {
      "Татвар төлөгчийн дугаар": "111097521658",
      "Хуулийн 7.1.1": "18188921",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "18188921",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1702436",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "16486485",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "16486485",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1648648.5",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1648648.5",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1648648.5",
    },
    {
      "Татвар төлөгчийн дугаар": "111039131228",
      "Хуулийн 7.1.1": "8681508",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8681508",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "998372",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7683136",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7683136",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "768313.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "768313.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "768313.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111056850294",
      "Хуулийн 7.1.1": "9210212",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9210212",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1059173",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8151039",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8151039",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "815103.9",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "815103.9",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "815103.9",
    },
    {
      "Татвар төлөгчийн дугаар": "111075860342",
      "Хуулийн 7.1.1": "6458758",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "6458758",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "742755",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "5716003",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "5716003",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "571600.3",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "571600.3",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "571600.3",
    },
    {
      "Татвар төлөгчийн дугаар": "110760891449",
      "Хуулийн 7.1.1": "15583564",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "15583564",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1528554",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14055010",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14055010",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1405501",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1405501",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1405501",
    },
    {
      "Татвар төлөгчийн дугаар": "642842700573",
      "Хуулийн 7.1.1": "22846788",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "22846788",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "20949288",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "20949288",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "2094928.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "2094928.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "2094928.8",
    },
    {
      "Татвар төлөгчийн дугаар": "111076480808",
      "Хуулийн 7.1.1": "6831600",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "6831600",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "785633",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6045967",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6045967",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "604596.7",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "604596.7",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "604596.7",
    },
    {
      "Татвар төлөгчийн дугаар": "111631430682",
      "Хуулийн 7.1.1": "9486520",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9486520",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1090948",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8395572",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8395572",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "839557.2",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "839557.2",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "839557.2",
    },
    {
      "Татвар төлөгчийн дугаар": "111335041948",
      "Хуулийн 7.1.1": "6181356",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "6181356",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "710854",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "5470502",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "5470502",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "547050.2",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "547050.2",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "547050.2",
    },
    {
      "Татвар төлөгчийн дугаар": "111083680178",
      "Хуулийн 7.1.1": "5409107",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5409107",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "622046",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4787061",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4787061",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "478706.1",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "478706.1",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "478706.1",
    },
    {
      "Татвар төлөгчийн дугаар": "112579470449",
      "Хуулийн 7.1.1": "16532604",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "16532604",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1583124",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14949480",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14949480",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1494948",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1494948",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1494948",
    },
    {
      "Татвар төлөгчийн дугаар": "111919601339",
      "Хуулийн 7.1.1": "24443212",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "24443212",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "22545712",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "22545712",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "2254571.2",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "2254571.2",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "2254571.2",
    },
    {
      "Татвар төлөгчийн дугаар": "103101411399",
      "Хуулийн 7.1.1": "15583564",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "15583564",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1528554",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14055010",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14055010",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1405501",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1405501",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1405501",
    },
    {
      "Татвар төлөгчийн дугаар": "110744980046",
      "Хуулийн 7.1.1": "7944808",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7944808",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "913652",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7031156",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7031156",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "703115.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "703115.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "703115.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111067220949",
      "Хуулийн 7.1.1": "7296037",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7296037",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "839043",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6456994",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6456994",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "645699.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "645699.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "645699.4",
    },
    {
      "Татвар төлөгчийн дугаар": "112560800874",
      "Хуулийн 7.1.1": "9747000",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9747000",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1120905",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8626095",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8626095",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "862609.5",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "862609.5",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "862609.5",
    },
    {
      "Татвар төлөгчийн дугаар": "111692920924",
      "Хуулийн 7.1.1": "12017236",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "12017236",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1323490",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "10693746",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "10693746",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1069374.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1069374.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1069374.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111089781022",
      "Хуулийн 7.1.1": "8183152",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8183152",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "941061",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7242091",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7242091",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "724209.1",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "724209.1",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "724209.1",
    },
    {
      "Татвар төлөгчийн дугаар": "111028601558",
      "Хуулийн 7.1.1": "4384944",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "4384944",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "504268",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "3880676",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "3880676",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "388067.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "388067.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "388067.6",
    },
    {
      "Татвар төлөгчийн дугаар": "112222380058",
      "Хуулийн 7.1.1": "15764020",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "15764020",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1244526",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14519494",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14519494",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1451949.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1451949.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1451949.4",
    },
    {
      "Татвар төлөгчийн дугаар": "110701731032",
      "Хуулийн 7.1.1": "17539440",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "17539440",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1641016",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "15898424",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "15898424",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1589842.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1589842.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1589842.4",
    },
    {
      "Татвар төлөгчийн дугаар": "111066361079",
      "Хуулийн 7.1.1": "4384944",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "4384944",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "504268",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "3880676",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "3880676",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "388067.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "388067.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "388067.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111046840679",
      "Хуулийн 7.1.1": "5235852",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5235852",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "602121",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4633731",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4633731",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "463373.1",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "463373.1",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "463373.1",
    },
    {
      "Татвар төлөгчийн дугаар": "111601920236",
      "Хуулийн 7.1.1": "5083352",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5083352",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "584584",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4498768",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4498768",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "449876.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "449876.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "449876.8",
    },
    {
      "Татвар төлөгчийн дугаар": "112217380247",
      "Хуулийн 7.1.1": "12670864",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "12670864",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1361074",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "11309790",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "11309790",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1130979",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1130979",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1130979",
    },
    {
      "Татвар төлөгчийн дугаар": "110725561318",
      "Хуулийн 7.1.1": "8659864",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8659864",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "995884",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7663980",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7663980",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "766398",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "766398",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "766398",
    },
    {
      "Татвар төлөгчийн дугаар": "111012251539",
      "Хуулийн 7.1.1": "5438696",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5438696",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "625449",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4813247",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4813247",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "481324.7",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "481324.7",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "481324.7",
    },
    {
      "Татвар төлөгчийн дугаар": "111957790866",
      "Хуулийн 7.1.1": "10064248",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "10064248",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1157388",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8906860",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8906860",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "890686",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "890686",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "890686",
    },
    {
      "Татвар төлөгчийн дугаар": "111948491383",
      "Хуулийн 7.1.1": "9889089",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9889089",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1137244",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8751845",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8751845",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "875184.5",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "875184.5",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "875184.5",
    },
    {
      "Татвар төлөгчийн дугаар": "111072991308",
      "Хуулийн 7.1.1": "16051072",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "16051072",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1555436",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "14495636",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "14495636",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1449563.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1449563.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1449563.6",
    },
    {
      "Татвар төлөгчийн дугаар": "112257750994",
      "Хуулийн 7.1.1": "14689004",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "14689004",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1477116",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "13211888",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "13211888",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1321188.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1321188.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1321188.8",
    },
    {
      "Татвар төлөгчийн дугаар": "110708051737",
      "Хуулийн 7.1.1": "16724048",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "16724048",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1594132",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "15129916",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "15129916",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1512991.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1512991.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1512991.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111686791301",
      "Хуулийн 7.1.1": "9771112",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "9771112",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1123676",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "8647436",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "8647436",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "864743.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "864743.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "864743.6",
    },
    {
      "Татвар төлөгчийн дугаар": "111011692488",
      "Хуулийн 7.1.1": "8428648",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8428648",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "969293",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7459355",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7459355",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "745935.5",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "745935.5",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "745935.5",
    },
    {
      "Татвар төлөгчийн дугаар": "480713510109",
      "Хуулийн 7.1.1": "6192177",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "6192177",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "712098",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "5480079",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "5480079",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "548007.9",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "548007.9",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "548007.9",
    },
    {
      "Татвар төлөгчийн дугаар": "111082051818",
      "Хуулийн 7.1.1": "12017236",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "12017236",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1323490",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "10693746",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "10693746",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "1069374.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "1069374.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "1069374.6",
    },
    {
      "Татвар төлөгчийн дугаар": "100151381246",
      "Хуулийн 7.1.1": "7746691",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7746691",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "890867",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6855824",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6855824",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "685582.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "685582.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "685582.4",
    },
    {
      "Татвар төлөгчийн дугаар": "111685280899",
      "Хуулийн 7.1.1": "4791548",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "4791548",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "551028",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4240520",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4240520",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "424052",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "424052",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "424052",
    },
    {
      "Татвар төлөгчийн дугаар": "112214660397",
      "Хуулийн 7.1.1": "5554716",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "5554716",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "638792",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "4915924",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "4915924",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "491592.4",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "491592.4",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "491592.4",
    },
    {
      "Татвар төлөгчийн дугаар": "110739400818",
      "Хуулийн 7.1.1": "7470076",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "7470076",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "859057",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "6611019",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "6611019",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "661101.9",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "661101.9",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "661101.9",
    },
    {
      "Татвар төлөгчийн дугаар": "112243770746",
      "Хуулийн 7.1.1": "26485688",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "26485688",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "1897500",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)":
        "24588188",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "24588188",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "2458818.8",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "2458818.8",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "2458818.8",
    },
    {
      "Татвар төлөгчийн дугаар": "112223801286",
      "Хуулийн 7.1.1": "8681508",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "8681508",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "998372",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "7683136",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "7683136",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "768313.6",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "768313.6",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "768313.6",
    },
    {
      "Татвар төлөгчийн дугаар": "112501850219",
      "Хуулийн 7.1.1": "3960246",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "0",
      "Нийт (1+2+3)": "3960246",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "455427",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "0",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "3504819",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "3504819",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар":
        "350481.9",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "350481.9",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "0",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "350481.9",
    },
    {
      "Татвар төлөгчийн дугаар": "855203020169",
      "Хуулийн 7.1.1": "0",
      "Хуулийн 7.1.2, 7.1.3, 7.1.4, 7.1.5, 7.1.7": "0",
      "Хуулийн 7.1.6": "1104832",
      "Нийт (1+2+3)": "1104832",
      "ЭМД, НДШ Хувь": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,1-5, 7,1,7)": "0",
      "ЭМД, НДШ Дүн (Хуулийн 7,1,6)": "124845",
      "Хуулийн 7.1-д заасан орлогод татвар ногдуулах орлого (4-6-7)": "979987",
      "Орлогын төрөл": "0",
      Орлого: "0",
      "Нийт татвар ногдуулах орлого": "979987",
      Шатлал: "1",
      "Хуулийн 7.1.1, 7.1.5, 7.1.7-д заасан орлогод Ногдуулсан татвар": "0",
      "Орлого хүлээн авсан сарын тоо /ажилласан сар/": "3",
      "Хуулийн 23.1-т заасан хөнгөлөлт сард ногдох": "0",
      "Хуулийн 23.1-т заасан хөнгөлөлт нийт": "0",
      "Хуулийн 7,1-д заасан орлогод ногдуулсан Хөнгөлөлтийн дараах татварын дүн":
        "0",
      "Хуулийн 7.1.6-д заасан орлогод ногдуулсан дүн": "97998.7",
      "Шууд бус орлогод ногдуулсан албан татвар": "0",
      "Нийт суутгуулсан албан татварын дүн": "97998.7",
    },
  ];

  const exportData = () => {
    const wb = XLSX.utils.book_new();
    const ws = XLSX.utils.json_to_sheet(data);
    XLSX.utils.book_append_sheet(wb, ws, "sheet1");
    XLSX.writeFile(wb, "test.xlsx");
  };

  return (
    <div>
      <div className="bg-white rounded-xl drop-shadow-md p-4 min-h-[calc(100vh-32px)]">
        <div className="flex space-x-2">
          {/* <div className="w-64">
            <TW.Select
              label="Тайлангийн хугацаа"
              onChange={(value: any) => setRange(value)}
            >
              <TW.Option value="0">Улиралаар</TW.Option>
              <TW.Option value="1">Хагас жилээр</TW.Option>
              <TW.Option value="2">Бүтэн жилээр</TW.Option>
            </TW.Select>
          </div> */}
          <div>
            <TW.Select
              label="Жил"
              value={year}
              onChange={(value: any) => setYear(value)}
            >
              <TW.Option value="2023">2023</TW.Option>
              <TW.Option value="2022">2022</TW.Option>
              <TW.Option value="2021">2021</TW.Option>
            </TW.Select>
          </div>
          <div>
            <TW.Select
              label="Улирал"
              value={quarter}
              onChange={(value: any) => setQuarter(value)}
            >
              <TW.Option value="1">1-р улирал</TW.Option>
              <TW.Option value="2">2-р улирал</TW.Option>
              <TW.Option value="3">3-р улирал</TW.Option>
              <TW.Option value="4">4-р улирал</TW.Option>
            </TW.Select>
          </div>
          <TW.Button onClick={getData}>Харах</TW.Button>
          {show && (
            <TW.Button color="green" onClick={exportData}>
              <div className="flex">
                <Icon.DocumentArrowDownIcon className="w-4 h-4 mr-2" />
                <div>Export</div>
              </div>
            </TW.Button>
          )}
          {taxesData && (
            <TW.Button
              color="green"
              onClick={() => {
                const gridApi = gridRef.current!.api;
                const now = new Date();
                // console.log(
                //   new Date().toDateString(),
                //   new Date().toISOString(),
                //   now.toLocaleDateString(),
                //   now.toLocaleString(),
                //   now.to
                // );
                gridApi.exportDataAsCsv({
                  fileName: `taxes_${year}_${quarter}_${now.getFullYear()}${
                    now.getMonth() + 1
                  }${now.getDate()}`,
                });

                // const data = gridApi.getRowData();

                // const jsonArray = [];

                // for (const row of data) {
                //   const jsonObject = {};
                //   for (const column of gridApi.getColumnDefs()) {
                //     jsonObject[column.field] = row[column.field];
                //   }
                //   jsonArray.push(jsonObject);
                // }
              }}
            >
              <div className="flex">
                <Icon.DocumentArrowDownIcon className="w-4 h-4 mr-2" />
                <div>Export</div>
              </div>
            </TW.Button>
          )}
        </div>
        <div
          className="ag-theme-alpine"
          style={{ width: "100%", height: "calc(100vh - 100px)" }}
        >
          <AgGridReact
            ref={gridRef} // Ref for accessing Grid's API
            rowData={taxesData} // Row Data for Rows
            columnDefs={columnDefs} // Column Defs for Columns
            animateRows={true} // Optional - set to 'true' to have rows animate when sorted
            rowSelection="multiple" // Options - allows click selection of rows
            onCellClicked={cellClickedListener} // Optional - registering for Grid Event
            copyHeadersToClipboard={true}
          />
        </div>
        {/* {taxesData && taxesData.length > 0 && (
          <div className="pt-4 overflow-auto">
            <table>
              <thead>
                <tr>
                  {Object.keys(taxesData[0]).map((key) => (
                    <th className="border-b border-blue-gray-100 bg-blue-gray-50 p-4">
                      <TW.Typography>{key}</TW.Typography>
                    </th>
                  ))}
                </tr>
              </thead>
              <tbody>
                {taxesData.map((row: any, index: any) => {
                  const isLast = index === taxesData.length - 1;
                  const classes = isLast
                    ? "p-4"
                    : "p-4 border-b border-blue-gray-50";
                  return (
                    <tr>
                      {Object.keys(row).map((key) => (
                        <td className={classes}>
                          <TW.Typography
                            variant="small"
                            color="blue-gray"
                            className="font-normal"
                          >
                            {row[key]}
                          </TW.Typography>
                        </td>
                      ))}
                    </tr>
                  );
                })}
              </tbody>
            </table>
          </div>
        )} */}
      </div>

      {/* <Button>button</Button>
      <Input
        type={"file"}
        accept=".xlsx, .xls"
        onChange={handleFileUpload}
      ></Input> */}
    </div>
  );
}
